profiling/stage_3/range_wrk.txt
Running 30s test @ http://127.0.0.1:8080
  4 threads and 12 connections
  Thread calibration: mean lat.: 3.628ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 73.575ms, rate sampling interval: 458ms
  Thread calibration: mean lat.: 46.401ms, rate sampling interval: 276ms
  Thread calibration: mean lat.: 121.765ms, rate sampling interval: 556ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.11ms    1.43ms  30.51ms   96.55%
    Req/Sec     0.90k   263.50     1.68k    88.90%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.92ms
 75.000%    1.13ms
 90.000%    1.59ms
 99.000%    6.59ms
 99.900%   20.86ms
 99.990%   29.39ms
 99.999%   30.11ms
100.000%   30.53ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.114     0.000000            1         1.00
       0.397     0.100000         8334         1.11
       0.529     0.200000        16749         1.25
       0.720     0.300000        25100         1.43
       0.817     0.400000        33312         1.67
       0.923     0.500000        41781         2.00
       0.950     0.550000        45830         2.22
       1.014     0.600000        50017         2.50
       1.048     0.650000        54165         2.86
       1.114     0.700000        58431         3.33
       1.132     0.750000        62472         4.00
       1.165     0.775000        64561         4.44
       1.213     0.800000        66653         5.00
       1.306     0.825000        68706         5.71
       1.462     0.850000        70784         6.67
       1.543     0.875000        72866         8.00
       1.564     0.887500        73914         8.89
       1.591     0.900000        74972        10.00
       1.618     0.912500        75990        11.43
       1.653     0.925000        77031        13.33
       1.758     0.937500        78067        16.00
       1.858     0.943750        78588        17.78
       2.002     0.950000        79109        20.00
       2.159     0.956250        79639        22.86
       2.355     0.962500        80149        26.67
       2.737     0.968750        80669        32.00
       2.955     0.971875        80933        35.56
       3.215     0.975000        81192        40.00
       3.511     0.978125        81450        45.71
       3.911     0.981250        81714        53.33
       4.399     0.984375        81970        64.00
       4.735     0.985938        82101        71.11
       5.287     0.987500        82231        80.00
       6.011     0.989062        82361        91.43
       6.987     0.990625        82492       106.67
       8.127     0.992188        82621       128.00
       8.855     0.992969        82686       142.22
       9.591     0.993750        82751       160.00
      10.447     0.994531        82816       182.86
      11.447     0.995313        82881       213.33
      12.647     0.996094        82947       256.00
      13.423     0.996484        82979       284.44
      14.503     0.996875        83012       320.00
      15.695     0.997266        83044       365.71
      16.703     0.997656        83076       426.67
      17.599     0.998047        83110       512.00
      18.143     0.998242        83125       568.89
      18.671     0.998437        83141       640.00
      19.247     0.998633        83158       731.43
      20.111     0.998828        83174       853.33
      20.911     0.999023        83190      1024.00
      21.311     0.999121        83198      1137.78
      22.239     0.999219        83206      1280.00
      22.767     0.999316        83215      1462.86
      23.311     0.999414        83223      1706.67
      23.919     0.999512        83231      2048.00
      24.399     0.999561        83236      2275.56
      24.463     0.999609        83239      2560.00
      24.927     0.999658        83244      2925.71
      25.439     0.999707        83247      3413.33
      25.647     0.999756        83251      4096.00
      26.047     0.999780        83253      4551.11
      26.639     0.999805        83255      5120.00
      27.215     0.999829        83257      5851.43
      27.839     0.999854        83259      6826.67
      29.023     0.999878        83261      8192.00
      29.327     0.999890        83262      9102.22
      29.391     0.999902        83263     10240.00
      29.407     0.999915        83264     11702.86
      29.455     0.999927        83265     13653.33
      29.583     0.999939        83266     16384.00
      29.999     0.999945        83267     18204.44
      29.999     0.999951        83267     20480.00
      30.015     0.999957        83268     23405.71
      30.015     0.999963        83268     27306.67
      30.031     0.999969        83269     32768.00
      30.031     0.999973        83269     36408.89
      30.031     0.999976        83269     40960.00
      30.111     0.999979        83270     46811.43
      30.111     0.999982        83270     54613.33
      30.111     0.999985        83270     65536.00
      30.111     0.999986        83270     72817.78
      30.111     0.999988        83270     81920.00
      30.527     0.999989        83271     93622.86
      30.527     1.000000        83271          inf
#[Mean    =        1.105, StdDeviation   =        1.429]
#[Max     =       30.512, Total count    =        83271]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  137089 requests in 30.01s, 208.69MB read
  Socket errors: connect 0, read 0, write 0, timeout 92
Requests/sec:   4567.35
Transfer/sec:      6.95MB