profiling/stage_3/status_while_get_wrk.txt
Running 30s test @ http://127.0.0.1:8080/v0/status
  4 threads and 1024 connections
  Thread calibration: mean lat.: 28.687ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 42.438ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 2.616ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 68.717ms, rate sampling interval: 395ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.06ms    3.06ms  39.46ms   79.54%
    Req/Sec    26.07k     7.04k   82.67k    72.11%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.33ms
 75.000%    5.38ms
 90.000%    7.70ms
 99.000%   15.19ms
 99.900%   25.04ms
 99.990%   31.84ms
 99.999%   35.58ms
100.000%   39.49ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.042     0.000000            2         1.00
       1.131     0.100000       186028         1.11
       1.667     0.200000       371925         1.25
       2.169     0.300000       558017         1.43
       2.711     0.400000       744115         1.67
       3.327     0.500000       929651         2.00
       3.667     0.550000      1022922         2.22
       4.029     0.600000      1115631         2.50
       4.431     0.650000      1209086         2.86
       4.879     0.700000      1301641         3.33
       5.383     0.750000      1394516         4.00
       5.663     0.775000      1441142         4.44
       5.971     0.800000      1487760         5.00
       6.311     0.825000      1534183         5.71
       6.695     0.850000      1580244         6.67
       7.143     0.875000      1626903         8.00
       7.403     0.887500      1650194         8.89
       7.695     0.900000      1673442        10.00
       8.027     0.912500      1696469        11.43
       8.423     0.925000      1719734        13.33
       8.911     0.937500      1743143        16.00
       9.207     0.943750      1754769        17.78
       9.543     0.950000      1766332        20.00
       9.943     0.956250      1777723        22.86
      10.431     0.962500      1789340        26.67
      11.039     0.968750      1800989        32.00
      11.391     0.971875      1806888        35.56
      11.775     0.975000      1812603        40.00
      12.231     0.978125      1818442        45.71
      12.783     0.981250      1824270        53.33
      13.423     0.984375      1830062        64.00
      13.831     0.985938      1832939        71.11
      14.287     0.987500      1835831        80.00
      14.839     0.989062      1838724        91.43
      15.431     0.990625      1841634       106.67
      16.127     0.992188      1844548       128.00
      16.527     0.992969      1846031       142.22
      16.975     0.993750      1847464       160.00
      17.519     0.994531      1848897       182.86
      18.159     0.995313      1850342       213.33
      19.007     0.996094      1851805       256.00
      19.471     0.996484      1852526       284.44
      19.967     0.996875      1853255       320.00
      20.559     0.997266      1853977       365.71
      21.199     0.997656      1854702       426.67
      21.999     0.998047      1855424       512.00
      22.575     0.998242      1855799       568.89
      23.071     0.998437      1856150       640.00
      23.727     0.998633      1856519       731.43
      24.319     0.998828      1856878       853.33
      25.135     0.999023      1857238      1024.00
      25.503     0.999121      1857429      1137.78
      25.919     0.999219      1857606      1280.00
      26.367     0.999316      1857788      1462.86
      26.783     0.999414      1857964      1706.67
      27.311     0.999512      1858146      2048.00
      27.711     0.999561      1858239      2275.56
      28.191     0.999609      1858328      2560.00
      28.639     0.999658      1858423      2925.71
      29.167     0.999707      1858512      3413.33
      29.647     0.999756      1858601      4096.00
      29.919     0.999780      1858646      4551.11
      30.159     0.999805      1858690      5120.00
      30.447     0.999829      1858736      5851.43
      30.767     0.999854      1858782      6826.67
      31.263     0.999878      1858829      8192.00
      31.583     0.999890      1858850      9102.22
      31.903     0.999902      1858874     10240.00
      32.335     0.999915      1858895     11702.86
      32.671     0.999927      1858919     13653.33
      32.927     0.999939      1858942     16384.00
      33.119     0.999945      1858951     18204.44
      33.375     0.999951      1858963     20480.00
      33.535     0.999957      1858974     23405.71
      33.759     0.999963      1858985     27306.67
      34.047     0.999969      1858998     32768.00
      34.207     0.999973      1859002     36408.89
      34.335     0.999976      1859008     40960.00
      34.687     0.999979      1859014     46811.43
      34.879     0.999982      1859019     54613.33
      35.135     0.999985      1859025     65536.00
      35.327     0.999986      1859028     72817.78
      35.487     0.999988      1859032     81920.00
      35.583     0.999989      1859034     93622.86
      35.615     0.999991      1859037    109226.67
      35.711     0.999992      1859039    131072.00
      35.903     0.999993      1859041    145635.56
      35.935     0.999994      1859042    163840.00
      36.191     0.999995      1859044    187245.71
      36.223     0.999995      1859045    218453.33
      36.255     0.999996      1859046    262144.00
      36.319     0.999997      1859047    291271.11
      36.607     0.999997      1859048    327680.00
      36.831     0.999997      1859049    374491.43
      36.831     0.999998      1859049    436906.67
      37.535     0.999998      1859050    524288.00
      37.535     0.999998      1859050    582542.22
      37.663     0.999998      1859051    655360.00
      37.663     0.999999      1859051    748982.86
      37.663     0.999999      1859051    873813.33
      38.943     0.999999      1859052   1048576.00
      38.943     0.999999      1859052   1165084.44
      38.943     0.999999      1859052   1310720.00
      38.943     0.999999      1859052   1497965.71
      38.943     0.999999      1859052   1747626.67
      39.487     1.000000      1859053   2097152.00
      39.487     1.000000      1859053          inf
#[Mean    =        4.055, StdDeviation   =        3.056]
#[Max     =       39.456, Total count    =      1859053]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2885512 requests in 30.00s, 288.94MB read
  Socket errors: connect 7, read 0, write 0, timeout 98
Requests/sec:  96173.78
Transfer/sec:      9.63MB